package peaksoft;

public class Main {
    /**
     * Задача ServiceImpl'дын ичиндеги методтоду ишке ашыруу керек
     * <p>
     * 1 - метод бул студенти id полясы менен табып и ошол студентин атын и фамилиясын озгортуу
     * 2 - метод бул студенти id полясы менен табып консолго чыгаруу
     * 3 - метод boolean кайтарат эгер биз издеген ат болсо
     * 4 - метод биз берген жаштын санын чыгарат
     * 5 - бул баардык студенттерди чыгаруу
     *    Cтуденттердин обьектилерин SerivceImpl классынын ичиндеги поляга конструктор аркылуу салсаныз болот
     *
     * 1 - жана 2 методтто Id полясы менен таппай калса анда анда - мындай студент жок деп чыгуусу керек
     *
     * Методтордун атын кайтаруу тибин параметрин озгортууго болбойт
     *
     * *
     */
    public static void main(String[] args) {

    }

}